# Упражнение №3. Однострочники.
#Каждая из задач должна быть решена в одну строку. Список чисел A уже введён.

#    1. Выведите элементы списка с чётными индексами.
A=[1,2,3,4,5]
print(A[::2])
