#    2. Найдите наибольший элемент в списке. Выведите значение элемента и его индекс.
A=[1,2,3,4,5]
print(max(A),A.index(max(A)))
