#    3. Выведите список в обратном порядке.
A=[1,2,3,4,5]
print(A[::-1])
